# SQL  ( Very Important) 

```
Pandas can read and write to various SQL engines through the use of a driver and the sqlalchemy python library .

How does it actually work ?

Step 1 : 
        Figure out what SQL Engine you are connecting to , for just a few examples : 
        -- PostgreSQL 
        -- MySQL 
        -- MS SQL Server 

Step 2 :
        Install the appropriate Python driver library ( Most likely requires a Google Search or ChatGPT )
        -- PostgreSQL - psycopg2 
        -- MySQL - pymysql
        -- MS SQL Server - pyodbc         

Step 3 : 
       Use the sqlalchemy library to connect to your SQL database with the driver: 
       -- docs.sqlalchemy.org/en/13/dialects/index.html

Step 4 : 
       -- Use the sqlalchemy driver connection with pandas read_sql method 
       -- Pandas can read in entire tables as a DataFrame or actual parse a SQL query through the connection :
       -- SELECT * FROM table;

** For our example , we'll use SQLite since it comes with Python and we can easily create a temporary database inside of your RAM . 

```

In [12]:
import pandas as pd
import numpy as np

In [13]:
## pip install sqlalchemy

'''
Collecting sqlalchemy
  Downloading SQLAlchemy-2.0.30-cp312-cp312-macosx_11_0_arm64.whl.metadata (9.6 kB)
Collecting typing-extensions>=4.6.0 (from sqlalchemy)
  Downloading typing_extensions-4.12.0-py3-none-any.whl.metadata (3.0 kB)
Downloading SQLAlchemy-2.0.30-cp312-cp312-macosx_11_0_arm64.whl (2.1 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 2.1/2.1 MB 9.7 MB/s eta 0:00:001 MB/s eta 0:00:01:01
Downloading typing_extensions-4.12.0-py3-none-any.whl (37 kB)
Installing collected packages: typing-extensions, sqlalchemy
Successfully installed sqlalchemy-2.0.30 typing-extensions-4.12.0
Note: you may need to restart the kernel to use updated packages.
'''

'\nCollecting sqlalchemy\n  Downloading SQLAlchemy-2.0.30-cp312-cp312-macosx_11_0_arm64.whl.metadata (9.6 kB)\nCollecting typing-extensions>=4.6.0 (from sqlalchemy)\n  Downloading typing_extensions-4.12.0-py3-none-any.whl.metadata (3.0 kB)\nDownloading SQLAlchemy-2.0.30-cp312-cp312-macosx_11_0_arm64.whl (2.1 MB)\n   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 2.1/2.1 MB 9.7 MB/s eta 0:00:001 MB/s eta 0:00:01:01\nDownloading typing_extensions-4.12.0-py3-none-any.whl (37 kB)\nInstalling collected packages: typing-extensions, sqlalchemy\nSuccessfully installed sqlalchemy-2.0.30 typing-extensions-4.12.0\nNote: you may need to restart the kernel to use updated packages.\n'

### Read Documentation : 
#### Read SQLAlchemy Dialects and External Dialects 
###### For Redshift , search Redshift + Pandas

### Create a local database

In [14]:
from sqlalchemy import create_engine

In [15]:
# Main piece of work , create connection 

temp_db = create_engine('sqlite:///:memory:')

# What it will does actually is create a temporary database inside computer's RAM

In [16]:
df = pd.DataFrame(data=np.random.randint(low=0,high=100,size=(4,4)),columns=['a','b','c','d'])
df

    a   b   c   d
0   7  53  99  26
1  24  32  94  40
2  47  61  65  29
3  41   2  40  88

In [17]:
df.to_sql(name='new_table',con=temp_db)

4

In [18]:
# Lets try to run the table again
# df.to_sql(name='new_table',con=temp_db)   # Error !

## It will have errors as table already present and pandas by default not allows recreate table

In [19]:
# Read from SQL database now 

new_df = pd.read_sql(sql='new_table',con=temp_db)  ## Reading entire table 
new_df

   index   a   b   c   d
0      0   7  53  99  26
1      1  24  32  94  40
2      2  47  61  65  29
3      3  41   2  40  88

In [20]:
# Other way of reading 

result = pd.read_sql_query(sql="SELECT a,c FROM new_table",con=temp_db)
result

    a   c
0   7  99
1  24  94
2  47  65
3  41  40

``` *********** TRY FURTHER CONNECTING TO MYSQL **************** ```